;------------ Encoding: UTF-16 ------------
; #CapsLock+ 设置样本
; - ******请务必阅读以下说明：******

; - **这里的设置是只读的，仅作说明参考，不要修改这里的设置（修改了也无效），需要自定义设置请在 settings.ini 中的对应段名中作添加修改
;     例如，需要开启开机自启动，请在 settings.ini 的 [Global] 下添加：autostart=1，并保存

; - "[]"里面是段名，不能修改
; - 各段下所有设置的格式都为：键名=键值，每行一个
; - 虽然 QSearch,QRun 和 QWeb 是不同的段，理论上它们的键名可以重复，但请不要这样设置，否则 +Q 的快速启动功能会无法区分
; - 分号开头的是注释行，注释行不影响设置，就像这几行
; - 以下把 Capslock+Q 弹出的输入框称为 "Qbar"


;----------------------------------------------------------------
; ##全局设置
[Global]
;是否开机自启动，1为是，0为否（默认）。
autostart=0

;需要加载的 JavaScript 文件，以逗号分隔，文件应放在与 Capslock+ 程序同文件夹下的 loadScript 文件夹。
;Capslock+ 将会按照顺序加载，加载完后 +Tab 可以使用里面的函数
;在本设置不为空时，启动 Capslock+ 时将自动创建 loadScript 文件夹，以及位于文件夹中的 debug.html 和 scriptDemo.js 文件
loadScript=myScript1.js,myScript2.js, myScript3.js , myScript4.js

;按下 Capslock+LAlt 键时，临时改变鼠标速度，范围是1~20。不设置的话默认3
;可以用 Capslock+LAlt+鼠标滚轮上 / 下快速设置这个值
mouseSpeed=3

;是否允许独立剪贴板功能，1为是（默认），0为否
allowClipboard=1

;是否开启程序加载动画，1是（默认），0否
loadingAnimation=1

;----------------------------------------------------------------
; ##Qbar搜索指令设置

; - 除default外的键名为搜索指令，该指令会按对应的搜索链接搜索关键词，例如：
;        这里设置了"bd=https://www.baidu.com/s?wd={q}"，可以在 Qbar 输入"bd capslock+"来百度搜索关键词"capslock+"
;   （不过bd这个指令已经自带，不需要设置，但可以通过将bd设置成别的链接来替换成别的搜索）

; - default为不输入任何指令时将使用的搜索

; - 键名可以自定义，如果下列例子中键名对应的键值没有被修改，Capslock+将保留相应的搜索指令

; - 每个网站的搜索链接（这里的键值）都不一样，可以尝试这样获取（不保证准确）：
;    1. 打开需要获取搜索链接的网站
;    2. 在搜索栏输入任意字符，例如"capslockplus"，搜索（有没有搜索出结果无所谓）
;    3. 在跳转后的地址栏中找到刚刚输入的字符，找到刚才搜索的字符并替换成"{q}"（不包括引号），得到搜索链接（替换后地址栏上的所有字符）

; - 可以使用 " ->search " 来添加一条设置到[QSearch]

; - 可以在键名的右边加上 （0~n个空格）<xxx> 来作为备注提示

[TTranslate]
;有道api接口
;翻译功能通过调用有道的api实现。
;接口的请求频率限制为每小时1000次，超过限制会被封禁。也就是说所有使用Capslock+翻译的人一小时内翻译的次数加起来不能超过1000次。
;有道api网址：http://fanyi.youdao.com/openapi

;接口类型，0为免费版，1为收费版。通过上面的网址申请的是免费版的，收费版是需要 email 他们来申请的。
apiType=0

;免费版的有道 api key 的 keyfrom 参数，申请 api 时要求填写的。收费版的不需要填写。
keyFrom=xxx

;有道api的key，如果自己申请到key，可以填入，这样就不用和其他人共用api接口，留空则使用自带的key，所有人共用
;注意如果是免费版的key，apiType也要相应设置为0，收费版的填写1
apiKey=0123456789

;----------------------------------------------------------------;
; ##按键功能设置

; - 可设置的按键组合有：
;   Capslock + F1~F12
;   Capslock + 0~9
;   Capslock + a~z
;   Capslock + -=[]\;',./
;   Capslock + Backspace, Tab, Enter, Space, RAlt
;   Capslock + LALt + F1~F12
;   Capslock + LALt + 0~9
;   Capslock + LALt + a~z
;   Capslock + LALt + -=[]\;',./
;   Capslock + LALt + Backspace, Tab, Enter, Space, RAlt

; - 以下设置键名是按键组合名，键值是对应功能，所有支持的功能都在下面

[Keys]

;Capslock+A -> 光标向左移动一个单词
caps_a=keyFunc_moveWordLeft

;Capslock+B -> 光标向下移动 5 行
caps_b=keyFunc_moveDown(5)

;独立剪贴板 1 的复制
caps_c=keyFunc_copy_1

;光标向下移动
caps_d=keyFunc_moveDown

;光标向上移动
caps_e=keyFunc_moveUp

;光标向右移动
caps_f=keyFunc_moveRight

;光标向右移动一个单词
caps_g=keyFunc_moveWordRight

;向左选中一个单词
caps_h=keyFunc_selectWordLeft

;向上选中
caps_i=keyFunc_selectUp

;向左选中
caps_j=keyFunc_selectLeft

;向下选中
caps_k=keyFunc_selectDown

;向右选中
caps_l=keyFunc_selectRight

;向下选中 5 行
caps_m=keyFunc_selectDown(5)

;向右选中一个单词
caps_n=keyFunc_selectWordRight

;选中至行末
caps_o=keyFunc_selectEnd

;光标移动到行首
caps_p=keyFunc_home

;打开 Qbar
caps_q=keyFunc_qbar

;delete
caps_r=keyFunc_delete

;光标向左移动
caps_s=keyFunc_moveLeft

;有道翻译
caps_t=keyFunc_translate

;选中至行首
caps_u=keyFunc_selectHome

;独立剪贴板 1 的粘贴
caps_v=keyFunc_paste_1

;backspace
caps_w=keyFunc_backspace

;独立剪贴板 1 的剪切
caps_x=keyFunc_cut_1

;光标向上移动 5 行
caps_y=keyFunc_moveUp(5)

;重复执行撤销以及重做
caps_z=keyFunc_undoRedo

;Capslock+（反引号） -> 激活绑定窗口 9 （最多到 20）
caps_backquote=keyFunc_winbind_activate(9)

;Capslock+1~8 -> 激活绑定窗口 1~8
caps_1=keyFunc_winbind_activate(1)

caps_2=keyFunc_winbind_activate(2)

caps_3=keyFunc_winbind_activate(3)

caps_4=keyFunc_winbind_activate(4)

caps_5=keyFunc_winbind_activate(5)

caps_6=keyFunc_winbind_activate(6)

caps_7=keyFunc_winbind_activate(7)

caps_8=keyFunc_winbind_activate(8)

;左右小括号
caps_9=keyFunc_doubleChar((,))

;向上选中 5 行
caps_0=keyFunc_selectUp(5)

;Capslock+-（减号） -> 向上翻页
caps_minus=keyFunc_pageUp

;Capslock+=（等号） -> 向下翻页
caps_equal=keyFunc_pageDown

;删除光标所在一行
caps_backspace=keyFunc_deleteLine

;TabScript
caps_tab=keyFunc_tabScript

;左右大括号
caps_leftSquareBracket=keyFunc_doubleChar({,})

;左右中括号
caps_rightSquareBracket=keyFunc_doubleChar([,])

;Capslock+\ -> 无
caps_backslash=keyFunc_doNothing

;Capslock+; -> end
caps_semicolon=keyFunc_end

;Capslock+' -> 左右双引号
caps_quote=keyFunc_keyFunc_doubleChar("""","""")

;换行——无论光标是否在行末
caps_enter=keyFunc_enterWherever

;Capslock+, -> 左右尖括号
;Qbar 激活时 Capslock+, -> 上一层目录
caps_comma=keyFunc_doubleAngle

;Capslock+. -> 输出 .
;Qbar 激活时 Capslock+. -> 前进一层回退后的目录
caps_dot=keyFunc_send_dot

caps_slash=keyFunc_doNothing

;Capslock+space -> enter
caps_space=keyFunc_enter

;Capslock+RAlt -> 无
caps_right_alt=keyFunc_doNothing

;打开 Capslock+ 首页
caps_f1=keyFunc_openCpasDocs

;打开 mathBoard
caps_f2=keyFunc_mathBoard

;下一首
caps_f3=keyFunc_mediaNext

;窗口透明；这个功能不能换按键
caps_f4=keyFunc_winTransparent

;重载 Capslock+
caps_f5=keyFunc_reload

;让某窗口固定在顶部
caps_f6=keyFunc_winPin

caps_f7=keyFunc_doNothing

;获取由选中的一段文字转换过的，供 TabScript 的 JS 函数调试的字符串
caps_f8=keyFunc_getJSEvalString

caps_f9=keyFunc_doNothing

caps_f10=keyFunc_doNothing

caps_f11=keyFunc_doNothing

;打开 / 关闭独立剪贴板
caps_f12=keyFunc_switchClipboard

;--------------------LAlt--------------------

;Capslock+LAlt+A -> 激活位于当前窗口最左边的窗口
caps_lalt_a=keyFunc_activateSideWin(fl)

caps_lalt_b=keyFunc_pageMoveLineDown(5)

;独立剪贴板 2 的复制
caps_lalt_c=keyFunc_copy_2

;激活位于当前窗口下边的窗口
caps_lalt_d=keyFunc_activateSideWin(d)

;激活位于当前窗口上边的窗口
caps_lalt_e=keyFunc_activateSideWin(u)

;激活位于当前窗口右边的窗口
caps_lalt_f=keyFunc_activateSideWin(r)

;激活位于当前窗口最右边的窗口
caps_lalt_g=keyFunc_activateSideWin(fr)

caps_lalt_h=keyFunc_doNothing

caps_lalt_i=keyFunc_doNothing

;将一个窗口推入窗口栈
caps_lalt_j=keyFunc_pushWinMinimizeStack

;将一个窗口推入窗口栈底部
caps_lalt_k=keyFunc_unshiftWinMinimizeStack

;窗口栈尾部的一个窗口出栈，并激活它
caps_lalt_l=keyFunc_popWinMinimizeStack

caps_lalt_m=keyFunc_doNothing

caps_lalt_n=keyFunc_doNothing

caps_lalt_o=keyFunc_doNothing

caps_lalt_p=keyFunc_doNothing

caps_lalt_q=keyFunc_doNothing

caps_lalt_r=keyFunc_tabNext

;激活位于当前窗口左边的窗口
caps_lalt_s=keyFunc_activateSideWin(l)

caps_lalt_t=keyFunc_doNothing

caps_lalt_u=keyFunc_doNothing

caps_lalt_v=keyFunc_paste_2

caps_lalt_w=keyFunc_tabPrve

;独立剪贴板 2 的 剪切
caps_lalt_x=keyFunc_cut_2

caps_lalt_y=keyFunc_pageMoveLineUp(5)

caps_lalt_z=keyFunc_putWinToBottom

;Capslock+LAlt+1: 窗口绑定 9
caps_lalt_backquote=keyFunc_winbind_binding(9)

;Capslock+LAlt+1: 窗口绑定 1~8
caps_lalt_1=keyFunc_winbind_binding(1)

caps_lalt_2=keyFunc_winbind_binding(2)

caps_lalt_3=keyFunc_winbind_binding(3)

caps_lalt_4=keyFunc_winbind_binding(4)

caps_lalt_5=keyFunc_winbind_binding(5)

caps_lalt_6=keyFunc_winbind_binding(6)

caps_lalt_7=keyFunc_winbind_binding(7)

caps_lalt_8=keyFunc_winbind_binding(8)

caps_lalt_9=keyFunc_doNothing

caps_lalt_0=keyFunc_doNothing

;光标移动到页首
caps_lalt_minus=keyFunc_jumpPageTop

;光标移动到页尾
caps_lalt_equal=keyFunc_jumpPageBottom

;backspace
caps_lalt_backspace=keyFunc_backspace

caps_lalt_tab=keyFunc_doNothing

caps_lalt_leftSquareBracket=keyFunc_doNothing

;Capslock+LAlt+]
caps_lalt_rightSquareBracket=keyFunc_doNothing

;Capslock+LAlt+\
caps_lalt_backslash=keyFunc_doNothing

;清空窗口栈
caps_lalt_semicolon=keyFunc_clearWinMinimizeStach

caps_lalt_quote=keyFunc_doNothing

caps_lalt_enter=keyFunc_doNothing

caps_lalt_comma=keyFunc_doNothing

caps_lalt_dot=keyFunc_doNothing

caps_lalt_slash=keyFunc_doNothing

caps_lalt_space=keyFunc_doNothing

caps_lalt_ralt=keyFunc_doNothing

caps_lalt_f1=keyFunc_doNothing

caps_lalt_f2=keyFunc_doNothing

caps_lalt_f3=keyFunc_doNothing

caps_lalt_f4=keyFunc_doNothing

caps_lalt_f5=keyFunc_doNothing

caps_lalt_f6=keyFunc_doNothing

caps_lalt_f7=keyFunc_doNothing

caps_lalt_f8=keyFunc_doNothing

caps_lalt_f9=keyFunc_doNothing

caps_lalt_f10=keyFunc_doNothing

caps_lalt_f11=keyFunc_doNothing

caps_lalt_f12=keyFunc_doNothing

caps_lalt_wheelUp=keyFunc_mouseSpeedIncrease

caps_lalt_wheelDown=keyFunc_mouseSpeedDecrease
;----------------其他功能----------------

;上一首
keyFunc_mediaPrev

;暂停 / 播放
keyFunc_mediaPlayPause

;音量增大
keyFunc_volumeUp

;音量减小
keyFunc_volumeDown

;静音
keyFunc_volumeMute

